#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 `success`
#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```

terraform
linode_domain.domain: Refreshing state... [id=1754394]
linode_instance.app: Refreshing state... [id=33288593]
linode_instance.db: Refreshing state... [id=33259985]
linode_domain_record.rewards: Refreshing state... [id=19660395]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # linode_instance.app has been deleted
  - resource "linode_instance" "app" {
      - authorized_users  = [
          - "linodeDT",
        ] -> null
      - backups           = [
          - {
              - enabled  = true
              - schedule = [
                  - {
                      - day    = "Scheduling"
                      - window = "Scheduling"
                    },
                ]
            },
        ] -> null
      - backups_enabled   = true -> null
      - boot_config_label = "My fealty-app Profile" -> null
      - id                = "33288593" -> null
      - image             = "private/15076102" -> null
      - ip_address        = "170.187.156.235" -> null
      - ipv4              = [
          - "170.187.156.235",
        ] -> null
      - ipv6              = "2600:3c02::f03c:92ff:fe3f:a140/128" -> null
      - label             = "fealty_app" -> null
      - private_ip        = false -> null
      - region            = "us-southeast" -> null
      - specs             = [
          - {
              - disk     = 25600
              - memory   = 1024
              - transfer = 1000
              - vcpus    = 1
            },
        ] -> null
      - status            = "running" -> null
      - swap_size         = 512 -> null
      - tags              = [
          - "fealty",
        ] -> null
      - type              = "g6-nanode-1" -> null
      - watchdog_enabled  = true -> null

      - alerts {
          - cpu            = 90 -> null
          - io             = 10000 -> null
          - network_in     = 10 -> null
          - network_out    = 10 -> null
          - transfer_quota = 80 -> null
        }

      - config {
          - kernel       = "linode/latest-64bit" -> null
          - label        = "My fealty-app Profile" -> null
          - memory_limit = 0 -> null
          - root_device  = "/dev/sda" -> null
          - run_level    = "default" -> null
          - virt_mode    = "paravirt" -> null

          - devices {
              - sda {
                  - disk_id    = 67045976 -> null
                  - disk_label = "fealty-app" -> null
                  - volume_id  = 0 -> null
                }

              - sdb {
                  - disk_id    = 67045977 -> null
                  - disk_label = "512 MB Swap Image" -> null
                  - volume_id  = 0 -> null
                }
            }

          - helpers {
              - devtmpfs_automount = true -> null
              - distro             = true -> null
              - modules_dep        = true -> null
              - network            = true -> null
              - updatedb_disabled  = true -> null
            }

          - interface {
              - purpose = "public" -> null
            }
          - interface {
              - ipam_address = "10.10.10.2/24" -> null
              - label        = "fealty-vlan" -> null
              - purpose      = "vlan" -> null
            }
        }

      - disk {
          - authorized_keys  = [] -> null
          - authorized_users = [] -> null
          - filesystem       = "ext4" -> null
          - id               = 67045976 -> null
          - label            = "fealty-app" -> null
          - read_only        = false -> null
          - size             = 25088 -> null
          - stackscript_data = (sensitive value)
          - stackscript_id   = 0 -> null
        }
      - disk {
          - authorized_keys  = [] -> null
          - authorized_users = [] -> null
          - filesystem       = "swap" -> null
          - id               = 67045977 -> null
          - label            = "512 MB Swap Image" -> null
          - read_only        = false -> null
          - size             = 512 -> null
          - stackscript_data = (sensitive value)
          - stackscript_id   = 0 -> null
        }

      - interface {
          - purpose = "public" -> null
        }
      - interface {
          - ipam_address = "10.10.10.2/24" -> null
          - label        = "fealty-vlan" -> null
          - purpose      = "vlan" -> null
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # linode_domain.domain will be updated in-place
  ~ resource "linode_domain" "domain" {
      - domain      = "buildscripts.xyz" -> null
        id          = "1754394"
        tags        = [
            "fealty",
        ]
        # (8 unchanged attributes hidden)
    }

  # linode_domain_record.rewards will be updated in-place
  ~ resource "linode_domain_record" "rewards" {
        id          = "19660395"
        name        = "rewards"
      ~ target      = "170.187.156.235" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # linode_instance.app will be created
  + resource "linode_instance" "app" {
      + authorized_users   = [
          + "linodeDT",
        ]
      + backups            = (known after apply)
      + backups_enabled    = true
      + boot_config_label  = (known after apply)
      + id                 = (known after apply)
      + image              = "dummy"
      + ip_address         = (known after apply)
      + ipv4               = (known after apply)
      + ipv6               = (known after apply)
      + label              = "fealty_app"
      + private_ip_address = (known after apply)
      + region             = "us-southeast"
      + specs              = (known after apply)
      + status             = (known after apply)
      + swap_size          = (known after apply)
      + tags               = [
          + "fealty",
        ]
      + type               = "g6-nanode-1"
      + watchdog_enabled   = true

      + alerts {
          + cpu            = (known after apply)
          + io             = (known after apply)
          + network_in     = (known after apply)
          + network_out    = (known after apply)
          + transfer_quota = (known after apply)
        }

      + interface {
          + purpose = "public"
        }
      + interface {
          + ipam_address = "10.10.10.2/24"
          + label        = "fealty-vlan"
          + purpose      = "vlan"
        }
    }

  # linode_instance.db must be replaced
-/+ resource "linode_instance" "db" {
      ~ backups            = [
          - {
              - enabled  = true
              - schedule = [
                  - {
                      - day    = "Scheduling"
                      - window = "Scheduling"
                    },
                ]
            },
        ] -> (known after apply)
      ~ boot_config_label  = "My fealty-db Profile" -> (known after apply)
      ~ id                 = "33259985" -> (known after apply)
      ~ image              = "private/15066809" -> "dummy" # forces replacement
      ~ ip_address         = "170.187.154.195" -> (known after apply)
      ~ ipv4               = [
          - "170.187.154.195",
        ] -> (known after apply)
      ~ ipv6               = "2600:3c02::f03c:92ff:fe3f:49a2/128" -> (known after apply)
      - private_ip         = false -> null
      + private_ip_address = (known after apply)
      ~ specs              = [
          - {
              - disk     = 25600
              - memory   = 1024
              - transfer = 1000
              - vcpus    = 1
            },
        ] -> (known after apply)
      ~ status             = "running" -> (known after apply)
      ~ swap_size          = 512 -> (known after apply)
        tags               = [
            "fealty",
        ]
        # (6 unchanged attributes hidden)

      ~ alerts {
          ~ cpu            = 90 -> (known after apply)
          ~ io             = 10000 -> (known after apply)
          ~ network_in     = 10 -> (known after apply)
          ~ network_out    = 10 -> (known after apply)
          ~ transfer_quota = 80 -> (known after apply)
        }

      - config {
          - kernel       = "linode/latest-64bit" -> null
          - label        = "My fealty-db Profile" -> null
          - memory_limit = 0 -> null
          - root_device  = "/dev/sda" -> null
          - run_level    = "default" -> null
          - virt_mode    = "paravirt" -> null

          - devices {
              - sda {
                  - disk_id    = 66989549 -> null
                  - disk_label = "fealty-db" -> null
                  - volume_id  = 0 -> null
                }

              - sdb {
                  - disk_id    = 66989550 -> null
                  - disk_label = "512 MB Swap Image" -> null
                  - volume_id  = 0 -> null
                }
            }

          - helpers {
              - devtmpfs_automount = true -> null
              - distro             = true -> null
              - modules_dep        = true -> null
              - network            = true -> null
              - updatedb_disabled  = true -> null
            }

          - interface {
              - ipam_address = "10.10.10.3/24" -> null
              - label        = "fealty-vlan" -> null
              - purpose      = "vlan" -> null
            }
        }

      - disk {
          - authorized_keys  = [] -> null
          - authorized_users = [] -> null
          - filesystem       = "ext4" -> null
          - id               = 66989549 -> null
          - label            = "fealty-db" -> null
          - read_only        = false -> null
          - size             = 25088 -> null
          - stackscript_data = (sensitive value)
          - stackscript_id   = 0 -> null
        }
      - disk {
          - authorized_keys  = [] -> null
          - authorized_users = [] -> null
          - filesystem       = "swap" -> null
          - id               = 66989550 -> null
          - label            = "512 MB Swap Image" -> null
          - read_only        = false -> null
          - size             = 512 -> null
          - stackscript_data = (sensitive value)
          - stackscript_id   = 0 -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  ~ App_Private_IP = [
      - "10.10.10.2/24",
    ]
  ~ App_Public_IP  = "170.187.156.235" -> (known after apply)
  ~ DB_Private_IP  = [
      - "10.10.10.3/24",
    ]
  ~ Domain_IP      = "170.187.156.235" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @biodrone, Action: `pull_request`, Working Directory: `deploy`, Workflow: `CI`*